app/controllers/ranks_controller.rb

SELECT "ranks".* FROM "ranks"
---
  def index
    @ranks = Rank.all

INSERT INTO "ranks" ("score_from", "score_to", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["score_from", 10.0], ["score_to", 8.0], ["name", "Nicolay"], ["created_at", 2018-11-21 10:56:18 UTC], ["updated_at", 2018-11-21 10:56:18 UTC]]
---
  def create
    @rank = Rank.new(rank_params)
    if @rank.save

DELETE FROM "ranks" WHERE "ranks"."id" = ?  [["id", 2]]
---
  def destroy
    @rank.destroy

SELECT  "ranks".* FROM "ranks" WHERE "ranks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_rank
      @rank = Rank.find(params[:id])